import Foundation

print("Hello, World!")

//print(직사각형별찍기())
//print(x만큼간격이있는n개의숫자(5, 3))
//print(행렬의덧셈([[1,2],[2,3]], [[3,4],[5,6]])) //이건 웨 안됨?
//print(행렬의덧셈([[1,2],[2,3]], [[3,4],[5,6]]))
//print(핸드폰번호가리기("010-9888-4321"))
//print(하샤드수(12))
//print(평균구하기([1,2,3,4,5]))
//print(클라츠추측(6))
//print(gcd(12, 3))
//print(lcm(12, 3))
//print(최대공약수와최소공배수(12, 3))
//print(짝수와홀수(4))
//print(제일작은수제거하기([2,1,3,4]))
//print(정수제곱근판별(12))
//print(내림차순으로배치하기(587231))
//print(자연수뒤집어배열로만들기(8312))
